ITHACA-FV/tutorials/CFD/10unsteadyBB_enclosed/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    Adiabatic_walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       19800;
    }
    Left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       20000;
    }
    Right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       20100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       20200;
    }
)

// ************************************************************************* //
