ITHACA-FV/tutorials/CFD/10unsteadyBB_enclosed/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    Tlift0
    {
	solver           GAMG;
        tolerance        1e-6;
        relTol           0;
        smoother         symGaussSeidel;
    }

    Tlift1
    {
	solver           GAMG;
        tolerance        1e-6;
        relTol           0;
        smoother         symGaussSeidel;
    }

    Tlift2   
    {
        solver		PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.0;
    }

    "(U|T|R)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|T|R)Final"
    {
        $U;
        relTol          0;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}


PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors     2;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    equations
    {
       "(U|T|R)" 0.5;
       "(Tlift0|Tlift1|Tlift2)" 0.5;
    }
}

// ************************************************************************* //
